import React from "react";
import "../../styles/Slider.css";
import battery from "../../assets/battery.png";
import { Swiper, SwiperSlide } from "swiper/react";
import { Mousewheel, Pagination } from "swiper";
import "swiper/css";
import "swiper/css/pagination";
import SliderItem from "./SliderItem";

const Slider = () => {
  const products = [
    {
      title: "سیستم ها ذخیره سازی انرژی",
      desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشه",
      features: [
        {
          item: "طراحی و ساخت سیستم مدیریت باتری",
        },
        {
          item: "طراحی و ساخت سیستم مدیریت حرارتی باتری",
        },
        {
          item: "طراحی، ساخت و تست انواع پک باتری با قابلیت¬های مختلف",
        },
        {
          item: "طراحی، ساخت و تست انواع سیستم های ذخیره ساز هیبرید",
        },
        {
          item: "بازیافت باتریهای لیتیومی",
        },
      ],
      img: battery,
      id: 1,
    },
    {
      title: "انرژی های تجدیدپذیر",
      desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشه",
      features: [
        {
          item: "طراحی و شبیه سازی انواع پیل های سوختی",
        },
        {
          item: "طراحی، ساخت و تست سیستم های جانبی پیل های سوختی",
        },
        {
          item: "طراحی و ساخت انواع سیستم های تأمین توان خورشیدی از نوع فتوولتائیک",
        },
      ],
      img: battery,
      id: 2,
    },
    {
      title: "سیستم ها اندازه گیری و کنترل",
      desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشه",
      features: [
        {
          item: "هوشمند سازی خودرو ",
        },
        {
          item: "طراحی ECU برای یک موتور بنزینی",
        },
        {
          item: "طراحی TCU برای یک گیربکس اتومات",
        },
        {
          item: "طراحی و ساخت انواع سیستم های میکروالکترومکانیک",
        },
        {
          item: "بازیافت باتریهای لیتیومی",
        },
      ],
      img: battery,
      id: 3,
    },
    {
      title: "خودروهای برقی",
      desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشه",
      features: [
        {
          item: " طراحی و کنترل انواع سیستم های محرکه تمام الکتریکی و هیبرید الکتریکی",
        },
        {
          item: "طراحی و ساخت سیستم های مدیریت حرارتی یکپارچه برای خودروهای برقی",
        },
        {
          item: "طراحی و ساخت سیستم های تهویه مطبوع در خودروهای برقی",
        },
        {
          item: "طراحی و ساخت شارژر و ایستگاه شارژ برای خودروهای برقی",
        },
        {
          item: "طراحی و ساخت شارژر خورشیدی بر روی خودرو",
        },
      ],
      img: battery,
      id: 4,
    },
  ];
  return (
    <Swiper
      className="mySwiper services-container_slider"
      direction={"vertical"}
      slidesPerView={1}
      mousewheel={true}
      loop={"true"}
      pagination={{
        clickable: true,
      }}
      modules={[Mousewheel, Pagination]}
    >
      {products.map((product) => {
        return (
          <SwiperSlide className="slide-item" key={product.id}>
            <SliderItem
              title={product.title}
              img={product.img}
              desc={product.desc}
              features={product.features}
            />
          </SwiperSlide>
        );
      })}
    </Swiper>
  );
};

export default Slider;
